# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.

# import random
# n = int(input("Введите количество монет: "))
# print("Выпавшие монеты: ", end = "")
# count0 = 0
# count1 = 0
# for i in range(n):
#     coin = random.randint(0,1)
#     print(coin, end = " ")
#     if coin == 0:
#         count0 += 1
#     if coin == 1:
#         count1 += 1
# if count0 < count1:
#     print(f"\nМинимальное количество нужно перевернуть монет решкой вверх - {count0}")
# else:
#     print(f"\nМинимальное количество нужно перевернуть монет гербом вверх - {count1}")
    
